[
  {
    "id": "1",
    "message": "Any one thing is not a sufficient conduit for my love for you. Thank you for the best six months of my life.",
    "colour": "#ffc4aadc",
    "icon": ["0xe25c", "MaterialIcons"],
    "date": [2022, 11, 13]
  },
  {
    "id": "2",
    "message": "Every word you speak is a note in the most beautiful song ever written. Your heart is a metronome and your laugh a crescendo. You are my favourite genre.",
    "colour": "#ffd4f0f0",
    "icon": ["0xe076", "MaterialIcons"],
    "date": [2022, 11, 14]
  },
  {
    "id": "3",
    "message": "I love rainy days. Rainy days are warm cuddles and tea. They're comfort food, reading socks, and making fun of dumb action movies. A rainy day is the perfect excuse to hog you all to myself and kiss and hug and hold you.",
    "colour": "#ffbffcc6",
    "icon": ["0xe0d6", "MaterialIcons"],
    "date": [2022, 11, 15]
  },
  {
    "id": "4",
    "message": "I love the way you view self growth. When we first started talking, I quickly found out that there were behavioral remnants of less-than-great relationships I was a part of. But I never felt broken. I felt empowered. You showed me that I could be better for myself and for you.",
    "colour": "#ffff928b",
    "icon": ["0xe313", "MaterialIcons"],
    "date": [2022, 11, 16]
  },
  {
    "id": "5",
    "message": "I always want to hold you. Your hand, your arm, your buttcheek. Every piece of me wants to be in contact with every piece of you. I get a thrill and my heart skips a beat every time we walk and our hands reach for one another.",
    "colour": "#fff1e0b0",
    "icon": ["0xe23a", "MaterialIcons"],
    "date": [2022, 11, 17]
  },
  {
    "id": "6",
    "message": "Until you, I didn't realize how precious time is. I always lived my life with time in excess. But when an hour passes in the blink of an eye, my entire perspective has changed. A lifetime doesn't even feel like enough time to love you.",
    "colour": "#ffdcb6aa",
    "icon": ["0xe6cf", "MaterialIcons"],
    "date": [2022, 11, 18]
  },
  {
    "id": "7",
    "message": "I will always have more love to give you. You need some reassurance? You want to hear me tell you that I love you? You need an extra cuddle even when we've been cudding all day? It doesn't matter. Tell me and I'll give you at least as much love as you want.",
    "colour": "#ffdcaadc",
    "icon": ["0xe6c6", "MaterialIcons"],
    "date": [2022, 11, 19]
  },
  {
    "id": "8",
    "message": "Little else exemplifies our cohesion as a team quite like making tea together. Both of us contribute varying amounts depending on the individual day and we always end up with a delicious and satisfying end product.",
    "colour": "#ffb1907f",
    "icon": ["0xe178", "MaterialIcons"],
    "date": [2022, 11, 20]
  },
  {
    "id": "9",
    "message": "Little else exemplifies how terribly we work as adjacent individuals quite like our (as of writing) unfinished Peggy's Cove puzzle. Our once fiery determination to finish the puzzle fell flat in the face of the temptation to cuddle for just five more minutes.",
    "colour": "#ff82ffcd",
    "icon": ["0xe250", "MaterialIcons"],
    "date": [2022, 11, 21]
  },
  {
    "id": "10",
    "message": "Sometimes I wish I was there for your figure skating and synchro days. It was such a huge part of your life for a long time and pictures aren't sufficient to capture the little things: morning Ashley, weary-eyed and bitter, slinking off to practice; inconsequential locker room conversations between friends and teammates that are forgotten minutes later; the thrill of a treat after a hard-fought competition day, muscles aching with the satisfaction of giving it one's all. Maybe I'm romanticizing the whole thing, but I'll never know for sure. What I do know is that I would have been your biggest fan.",
    "colour": "#ffbec6f0",
    "icon": ["0xe330", "MaterialIcons"],
    "date": [2022, 11, 22]
  },
  {
    "id": "11",
    "message": "I like thinking about that summer day when we were just getting over our colds and we paid a visit to Osprey Village. We were sitting on the grass patch next to the trail with our ice cream and your camera and just being goofballs in public. Everybody around us definitely knew that we were in love. I have so many memories of that trail with so many different people and yet I have to struggle to think of anyone except you when it comes to mind. You have so easily pushed yourself to the forefront of my brain.",
    "colour": "#ffbef0c9",
    "icon": ["0xe331", "MaterialIcons"],
    "date": [2022, 11, 23]
  },
  {
    "id": "12",
    "message": "It snowed tonight for the first time this seasonal cycle. And with the snow, another entire facet of life has been unlocked for us to enjoy. Like activities! Sledding, snowball fights, snow construction of all kinds. But not just that. It unlocks new feelings. I can look at the beauty in the landscape of a fresh snowfall and then in your face when your excitement shines through your eyes. It unlocks new ways to show my love. I can shovel a path for my lady to get to her car. I can make a heart for you out of snow. I can tell you that I love you snow snow snow much. I can run away from it all with you and shun the snow; we can hide away inside. Warmth is so much cozier when contrasted with cold. All of the things seem like so much fun and I can't wait to experience it all with you.",
    "colour": "#ffaaccdc",
    "icon": ["0xf056b", "MaterialIcons"],
    "date": [2022, 11, 29]
  }
  
]
